content/personal_lists/quotes.md
+++
title = "Quotes"
author = ["Hrishikesh Barman"]
draft = false
+++

Thoughts that my came across on the internet, most of them are cliché and cringe, some are paraphrased, some are directly stolen, some are original(lol) probably.


## Education and Research {#education-and-research}

-   As a PhD student, your post reads like a beautiful research paper. Motivation, prior work, contributions, technical details, example use cases, self-references, future work, even a system design chart. You've certainly sold me on the extension, great work!
-   In Theory, Theory and Practice are the same. In Practice they're not.
-   You may not be the smartest person in your field, but you should know the most about it.
-   there is very little that you cannot learn, just things you haven’t learned yet.
-   Tell me and I forget, teach me and I may remember, involve me and I learn.
-   And we must study through reading, listening, discussing, observing, and thinking. We must not neglect any one of those ways of studying. The trouble with most of us is that we fall down on the latter _thinking_ because it's hard work for people to think. All of the problems of the world could be settled easily if men were only willing to think.  - Thomas J Watson
-   One of the dirtiest tricks the Indian education system plays on students is to make students believe that they are not capable of doing something so as to filter out students ultimately achieving nothing
-   Spending a few days researching the topic always completely changes how I am going to solve it.
-   Every time we do sit down to learn something, we have to make a decision whether to widen our breadth of knowledge, or to dig deeper into something we're already familiar with. Then we have to decide which thing within those two broad categories we're going to tackle.
-   Breakthroughs happen when what is suddenly possible meets what is desperately needed.
-   We discovered that education is not something which the teacher does, but that it is a natural process which develops spontaneously in the human being
-   A new scientific truth does not triumph by convincing its opponents and making them see the light, but rather because its opponents eventually die, and a new generation grows up that is familiar with it.
-   It was more important to inspire the students so that they wanted to learn, than to actually teach them the material
-   What I cannot create, I do not understand. – Richard Feynman
