content/personal_lists/quotes.md


## Programming {#programming}

-   why would u write code without documenting it, write for humans man. computer toh 1 and 0 bhi samajh lega.
-   ActivityPub isn't the future. Useful things that are built, brought to market, and meet user needs that may happen to use ActivityPub under the hood are the future. Knowing what is useful for whom and how to bring it to market in a sustainable manner for the people it's intended for is a super critical element. One that's often overlooked. Specs are like plumbing pipes. People care about sinks, showers, and stuff like that. The pipe fittings, materials, and sizes enable a lot. But, it's not what the end users tend to care about.
-   Simple things should be simple it's ok if complicated things are complicated.
-   If you try 'cat /boot/vmlinuz &gt; /dev/dsp' (on a properly configured system) you should hear some sound on the speaker. That's the sound of your kernel!
-   I read about bootfs at a book from our libraries university from 2019. I contacted the lector of it and he contacted the authors and it turned out, that they had their information from the internet, including stackoverflow. Unfortunately I had to rethink my trust in books. - some SO post
-   We reject: kings, presidents, and voting. We believe in: rough consensus and running code. -David Clark 1992
-   A little duplication is far cheaper than the wrong abstraction.
-   Simplicity is prerequisite for reliability.
-   The more I research, read, talk to folks, and think about programming, the more I’m convinced that there are no rules. There are only guidelines.
-   "Train Basic every day!"—reads a poster (bottom center) in a Russian school (c. 1985–1986).
-   adding manpower to a late software project makes it later
-   "The revolution in views of programming started by Dijkstra's iconoclasm led to a movement known as structured programming, which advocated a systematic, rational approach to program construction. Structured programming is the basis for all that has been done since in programming methodology, including object-oriented programming."
-   The truth is that programming isn't a passion or a talent, it is just a bunch of skills that can be learned. Programming isn't even one thing, though he had been talking about it as if it were; it requires all sorts of skills and coding is just a small part of that. Things like design, communication, writing, and debugging are needed. Also, "we need to have at least one person who understands Unicode", he said to laughter.
-   `grep` is a word derived from the command for regular expression searching in the ****ed**** editor: g/re/p meaning "Global search for Regular Expression and Print matching lines"
-   The most important advice I can share with you, as you're starting out, is that a career is a long road, with many twists and turns along the way. The best way I know of to excel in software is to keep a growth mindset. The more you can learn and improve, the more career options you'll have.
-   No website is as good as a good book. And no good book is as good as a disassembly output.
-   A three-line proof of a subtle theorem is the distillation of years of activity. Reading mathematics involves a return to the thinking that went into the writing
-   Knowledge Debt, Being a programmer is about being in a continuous state of learning. Letting knowledge debt accumulate can slowly bring your career and productivity to a halt. If you have a knowledge debt in an area that is essential to your work, you will find that it takes more time and effort to write new features and much, much more time and effort to fixing bugs. The longer you take in returning the debt, the more “time interest” it will cost you.
-   Matching string sequences is one of the most common problems you’ll face as a programmer.
-   Reminder that it takes just as much effort (time, money, staff, etc.) to build the wrong thing as it does the right thing. Problem discovery is under appreciated as a practice in software engineering, especially when compared to problem solving.
-   The device(mouse) was patented in 1947, but only a prototype using a metal ball rolling on two rubber-coated wheels was ever built, and the device was kept as a military secret.
-   Condition your brain to think in the world of data structures.
-   As soon as an Analytical Engine exists, it will necessarily guide the future course of the science. Whenever any result is sought by its aid, the question will then arise—By what course of calculation can these results be arrived at by the machine in the shortest time?
-   John Carmak on DRY on twitter
    -   Everyone knows that when you have similar code repeated several times that you should consolidate into a loop or function, but changing discrete variables into arrays and adding loops can have a small readability cost, so sometimes it can feel like a debatable choice for something small just repeated two or three times.
    -   Usually, optimizing for readability is positive, but a requirement to keep two separate things aligned through future changes is an “invisible constraint” that is quite likely to cause problems eventually.
    -   Many years ago, I would casually copy-paste-paste-paste-modify 4D vector statements, but now I almost never even do two related statements like that.
    -   The hazard is when you combine two things that are close, but not exactly the same, and the strain induces complexity.
    -   "Don't Repeat Yourself" versus "Repeat Once or Twice"
    -   But when things aren’t exactly the same, do it three times before trying to infer an abstraction.


## Management {#management}

-   Till the time we don’t create strong communities, we will always feel alone. It is just mind tricking us in believing that ‘I’ is the most powerful entity in our best/worst moments. To create strong communities, we must accept that humans comes in different shades/color/psyche
-   anti productivity can be a new productivity, anti-brand can be new form of brand
-   While they were saying among themselves it cannot be done, it was done.
-   This thing we call “money” is just a (slow, lossy &amp; unsecure) database for labor allocation. Investing is meaningless without people, at least until AGI happens, which will obviate need for labor &amp; necessitate UBI. - elon
-   The world might criticize your ideas. Let that feedback sharpen your insights. You need to be devoid of emotions when it comes to seeking knowledge. The moment you judge yourself for your curiosity, for your desire to connect the dots, you will not grow.
-   Find faults to fix, not to blame.
-   Ask to be involved early or ask for clarity, we can only pick one.
-   How Apple makes even Microsoft seem well-behaved and conformant.
-   As soon as you give people a metric they're judged by, they optimize for that metric rather than do quality work.
-   Cashflow is like oxygen, cut it off and firm falls apart.
-   Ørsted was the first modern thinker to explicitly describe and name the ****thought experiment****.
-   absence of evidence is not evidence of absence.
-   Euler went blind and said “Now there will be fewer distractions”.


## Science {#science}

-   We thought the Internet was going to be a global library but then it turned out to be a global bookstore instead. Nice coffee tho.
-   The term "galvanometer," in common use by 1836, was derived from the surname of Italian electricity researcher Luigi Galvani, who in 1791 discovered that electric current would make a dead frog's leg jerk.
