content-org/personal_lists.org
** Random
- hey baby unclench ur jaw blink a few times drink some water
- Who breaks a butterfly upon a wheel?
- Not really facts… more like loosely postulated theories presented with overconfidence.
- Yggdrasil is an immense mythical tree that plays a central role in Norse cosmology, where it connects the Nine Worlds.
- With passive learning (like passively reading), you get the most limited form of understanding/knowing. It is ephemeral, and you are not able to reconstruct that on your own. The second level is "knowing by first hand experience". At this level, you are able to understand/witness and if necessary rediscover the knowledge on your own. Finally, the third level is "knowing by heart". At this level, you internalized the knowledge so that it becomes part of your nature. You grok it. - Murat
** Life
- The main idea is to understand how your brain works, so you can understand its strengths and weaknesses, using its strengths and compensating for its weaknesses.
- Lock yourself in a room making 5 beats a day for 3 summers - ye
- You can take a break when you're dead ;-;
- Introversion is the state of primarily obtaining gratification from one's own mental life
- I haven't failed, i just postponed by success - Rajnikanth
- People who change their minds have a tendency of being right a lot.
- Nothing is really ours until we share it. (C. S. Lewis)
- Don't waste a second looking back at your expectations. Face forward, and face it with a smug little grin.
- Humans don't have direct access to reality, we view reality [[https://www.youtube.com/watch?v=LWiM-LuRe6w][via our cultures]]. Social media as of 2023 by curation of content has created an illusion that some people confuse with reality.
- I speak only of myself since I do not wish to convince, I have no right to drag others into my river, I oblige no one to follow me and everybody practices his art in his own way. - Dada Manifesto 1918
- lack of regret is hell of a drug
- You will rarely get more than what you're willing to ask for. By not risking a rejection, you reject yourself before anyone else can.
- We live what? 75-85 years? I don't want to retire at 60 only to go to the hospital for the last 10-15 years of my life, some redditor
- The most important thing is the ability to survive until you get lucky
- "If the world were perfect, it wouldn't be." - Yogi Berra
- Most people forget that the goal isn’t money. The goal is to spend days as you wish.
- Consistency is the exponent.
- The odds increase, the harder you try.
- The greatest enemy of a good plan, is the dream of a perfect plan
- If you don't ask for anything, don't be surprised when you get nothing
- There are so many interesting topics I want to learn, but "I don't have time". The sad reality is: we do have time. We just waste so much of it. Sometimes I look at my screen time and see the hours I could've spent productively. But time management is harder than it sounds.
- "So the universe is not quite as you thought it was. You'd better rearrange your beliefs, then. Because you certainly can't rearrange the universe."
- Everybody wants to win, but the winners are the rare ones who obsessively practice their craft.
- don't do your best, do whatever it takes.
- The only real test of intelligence is if you get what you want out of life.
- Be liberal in what you accept, and conservative in what you send
- Anyone who either cannot lead the common life or is so self-sufficient as not to need to, and therefore does not partake of society, is either a beast or a god.
- Do not confuse motion and progress (man riding a toy horse)
- Attaching your happiness or sadness to someone is the quickest way to lose
- Manage your time like a CEO of multi billion dollar company. Seriously, don't waste your time. TV shows, movies, songs, endless bakchodi with friends is easy to do but does give you anything in return.
- Be soft spoken and DO NOT react to anything
- Don’t compare your day-to-day activities with everybody’s highlight reel
- What they say is required is not really what is required.
- The whole world is not looking at you.
- Keep your word. Do what you say you will do.
- Sunil Pai tweeted this randomly on twitter
  - can’t help anyone without first fixing yourself
  - big software is built with very small steps
  - helping people without expectation yields the biggest returns
  - self awareness leads to resilience
  - culture breeds individualism
  - long term relationships are dynamic
  - exercise is great for mental health
  - your reputation is developed by other people’s words
  - I had to accept the worst parts of myself to love myself
  - explicit rules of engagement lead to better vibes
  - perspective is reality
  - the reason spiderverse is good is because you can tell people you like the animation but actually it’s because you relate to the characters and it makes you feel like you can do great things no matter what and that’s why you played the sunflower/what’s up danger song 100x
- Be reluctant to assign bad motives to others. Most of us are blundering, not conspiring.
- Each breakup brings you closer to the person who is right for you.
- Learn as much as you can, about as many things as you want.
- Don't manage your time. Invest it.
- Actions rule your life, words only help.
- Give more than you take.
- An expert is a man who has made all the mistakes, which can be made, in a very narrow field.
- The formula to induce motivation, in my experience, starts with action, which sparks inspiration, which sparks motivation, which leads to action, and the loop continues.
- Joy, Happiness and Satisfaction
  - Joy is jumping into puddle
  - Happiness is seeing your son jump in a puddle
  - Satisfaction is knowing that you jumped into a puddle
- Somebody once described balance to me as three buckets filled with water. One for career, a second for physical health, and a third for social and family life. At any point, one bucket might be running low. But as long as the overall water level is high enough, things should be fine. Importantly: the water represents your level of satisfaction, not the hours you spend.
- 2 things the rock does to manage his psychology:
  - remember what it was like when he  started with nothing
  - ask himself “how bad of a motherfucker do you think you are”
** Creating
- My favorite phase of any project is the one where nobody knows what to do and everything seems impossible.
- In writing, the fastest way to build credibility is to state the other side’s argument better than they can
- We can fix it. We have the technology. OK. We need to create the technology. Alright. The policy guys are mucking with the technology. Relax. WE'RE ON IT. Dan Kaminsky's Bio.
- A disciplined, consistent effort to develop, propagate, and exploit them should indeed yield an order-of-magnitude improvement. There is no royal road, but there is a road.
- Speed is important when creating stuff.
  - 2 things
    - More [[https://news.ycombinator.com/item?id=36312295][smaller]] iterations
    - Confirming you're working toward a desired outcome. (deliver the working draft)
  - More speed = More shit gets done per unit time
  - Time is asset, if you know you can do things fast, cost(time) of doing something in your mind is low, so you'd want to do it. It helps with getting the [[https://en.wikipedia.org/wiki/Activation_energy][activation energy]].
  - Fast work != sloppy work, push yourself more than you think is healthy, strive to become both good and fast.
** Geo/Political
- Never accept a no from someone who doesn't have the power to say yes
- “India is not, as people keep calling it, an underdeveloped country, but rather, in the context of its history and cultural heritage, a highly developed one in an advanced state of decay.” ― Shashi Tharoor
- A developed country is one where the rich take the public transport, not one where poor people have cars
** Startup
- Being an entrepreneur is the arts and science of accomplishing more with less money, less time, less staff etc.
- Great products unlock something.
- If you don’t have a enough capital to launch your business  the way you plan, change your plan.
- Starting a business is truly a marathon, not a sprint.
- It takes a village to create something great, you need others and make sure they share your values.
- If there is no competition, there is no market.
- Money only accelerates success or failure - it will not turn something poor into something great by itself.
- Consistently create value for nothing in return for your target personas (eg content marketing, freebies) and it will pay dividends exponentially in the long-run.
- Do the right thing instead of compromise.
- Maintain a goal beyond just rewards for yourself.
