content-org/personal_lists.org
** Making money
All this might be cringe but sometimes motivation is useful.
- *Be an unrelenting machine:* Commit to your goals and do not waver from them a one bit regardless of what else is there. If your goals is to become a millionaire, you need to be an unrelenting machine that does not let emotions make you give up / stop. You either get it done with 100% commitment or you don't. Be a machine.
- *Market opportunity:* A million dollars isn't a lot but it can be a lot if the market opportunity is not large enough. Bill Gates and Steve Jobs put together cannot become too wealthy without changing the business if the TAM is $10bn.
- *Leverage:* Leverage skills you know, Leverage information that others undervalue
- *Distribution channels:* Get as many distribution channels as possible, each one by itself may not be large, but if you have many it starts to add up. It also diversifies your risk.
- *Go w gut:* Go with what your gut says, regardless of how it might look to the rest of the world. Fame is fleeting in the traditional sense. Become famous with your customers. They're the ones that truly matter. What they think matters and they will ultimately put their money where their mouth is.
- *Be a master of information:* It gives you an edge.
- *Make waves, don't ride them:* Youtube introduced (flash+one click upload+share), other people rode the wave.
- *Be so good they can't ignore you:* Applies to both self and product.
- *Look for the accessory ecosystem:* If there's a huge new product/shift, there's usually money to be made in the accessory ecosystem.
- *Productize a service:* If you can make what might normally be considered a service into a scaleable, repeatable, and efficient process that makes it seem like a product you can make a good amount of money.
** Relationships
- Scar tissues ([[https://gist.github.com/gtallen1187/27a585fcf36d6e657db2][talk given by John Ousterhout about sustaining relationships]])
 - A single catastrophic event around the the end of the relationship, but that’s typically a symptom rather than a cause.
 - What typically happens is it accumulates in the little things that just build up over time, and I call those scar tissues.
 - when you have a wound that doesn't heal quite properly and you get this other tissue that just sort of fills the gap, which is called scar tissue, and that tissue is not as strong as the original tissue that was there. So, scar tissue is weak
 - You know if you ever hear the phrase "You always X": scar tissue.
 - So, when there's an issue, you somehow have to resolve it where there is zero lingering animosity.
 - Some people are just too nice, and they wreck the relationships. They think, “Oh, it's not a big deal, it's just one little thing, not worth having a big argument about it. I'll just give in.” Well, that seems generous, but it's a really bad idea. You have to ask yourself, "Are you really, completely, 100% over this? You're giving in? No animosity? You're not secretly hoping that maybe they'll do something for you in return or a little behavior change here or there?"
 - The trick is, again, you just have to avoid the creation of scar tissue. Not easy, but it's the only solution.
